#+TITLE: Emacs Settings
#+DATE: <2017-08-11 Fri>
#+AUTHOR: Yann Herklotz
#+EMAIL: ymherklotz@gmail.com

** My Code

#+BEGIN_SRC emacs-lisp
  (defun y/swap-windows ()
    "Swaps two windows and leaves the cursor in the original one"
    (interactive)
    (ace-swap-window)
    (aw-flip-window))

  (defun y/fsharp-reload-file ()
    "Reloads the whole file when in fsharp mode."
    (interactive)
    (fsharp-eval-region (point-min) (point-max)))

  (defun y/exit-emacs-client ()
    "consistent exit emacsclient.
     if not in emacs client, echo a message in minibuffer, don't exit emacs.
     if in server mode
        and editing file, do C-x # server-edit
        else do C-x 5 0 delete-frame"
    (interactive)
    (if server-buffer-clients
        (server-edit)
      (delete-frame)))

  (defun y/beautify-json ()
    (interactive)
    (let ((b (if mark-active (min (point) (mark)) (point-min)))
          (e (if mark-active (max (point) (mark)) (point-max))))
      (shell-command-on-region b e
       "python -m json.tool" (current-buffer) t)))
#+END_SRC

#+RESULTS:
: y/beautify-json

Setting up my keybindings
#+BEGIN_SRC emacs-lisp
  (define-prefix-command 'y-map)
  (global-set-key (kbd "C-c y") 'y-map)

  (define-key y-map (kbd "s") 'y/swap-windows)
  (global-set-key (kbd "C-c q") 'y/exit-emacs-client)
  (define-key y-map (kbd "j") 'y/beautify-json)

  (add-hook 'fsharp-mode-hook
            (lambda () (local-set-key (kbd "C-c C-c") #'y/fsharp-reload-file)))
#+END_SRC

#+RESULTS:
| lambda | nil | (local-set-key (kbd C-c C-c) (function y/fsharp-reload-file)) |

Registers
#+BEGIN_SRC emacs-lisp
  (set-register ?e (cons 'file "~/.emacs.d/myinit.org"))
  (set-register ?n (cons 'file "~/Dropbox/Org/note.org"))
  (set-register ?s (cons 'file "~/Dropbox/Org/schedule.org"))
  (set-register ?p (cons 'file "~/Dropbox/Org/project.org"))
#+END_SRC

#+RESULTS:
: (file . ~/Dropbox/Org/project.org)

